# configs/yolov8s-seg-p2.yaml
# ─────────────────────────────────────────────────────────────────────────────
# EXPERIMENTAL — already trained as V12, did NOT help (kept for reference)
# ─────────────────────────────────────────────────────────────────────────────
#
# OUTCOME (V12): this P2 head was trained at imgsz=768 with clean V6 augmentation and did NOT
# beat the baseline — best Mask mAP50-95 0.2215 (a single-epoch spike; ~0.21 sustained, ≈−0.02 vs
# V6/V10). Decisively, recall did NOT improve (0.393 vs V10's 0.468), so the high-resolution head
# failed at its one job: detecting more tiny lesions. The bottleneck is the full-image input, not
# the detection head. See the V12 section in docs/AlphaDent_training_summary_EN.md. The rationale
# below is the original (pre-result) motivation.
#
# P2 detection head for YOLOv8s-seg (small-object focused).
#
# What the P2 head adds:
#   Standard YOLOv8 decodes predictions at three strides: 8, 16, 32 (P3-P5).
#   Adding a P2 head adds a fourth stride-4 detection layer that operates on
#   a 4× higher-resolution feature map.  For an imgsz=768 input this gives a
#   192×192 grid instead of the normal 96×96 (P3), doubling spatial resolution
#   for the smallest detection layer.
#
#   This is especially valuable for tiny Caries lesions that occupy fewer than
#   ~10×10 pixels in the original image — objects that often map to a single
#   anchor cell at P3.
#
# Trade-offs:
#   - ~15-25% more parameters and GPU memory due to the extra detection head
#     and the higher-resolution feature maps it processes.
#   - Slightly slower training and inference (more FLOPs at stride 4).
#   - P2 heads can overfit on small datasets; recommended only if val set
#     has enough tiny-lesion examples to provide a reliable mAP signal.
#
# How to use:
#   from ultralytics import YOLO
#   model = YOLO("configs/yolov8s-seg-p2.yaml")  # build from scratch
#   model.train(data=..., imgsz=768, ...)
#
#   OR load official weights and override the architecture:
#   model = YOLO("yolov8s-seg.pt")
#   model = YOLO("configs/yolov8s-seg-p2.yaml").load("yolov8s-seg.pt")
#   # Note: weight loading may skip the new P2 head (random init for new layers)
#
# Reference: Ultralytics YOLOv8 architecture docs / GitHub issues on P2 heads.
# ─────────────────────────────────────────────────────────────────────────────

# Number of classes (AlphaDent has 9: 0–8)
nc: 9

# Scales (s = small variant)
# NOTE: Ultralytics requires the list form [depth, width, max_channels].
# The dict form (depth:/width:/max_channels:) makes Ultralytics unpack the keys
# as strings -> "TypeError: '<' not supported between instances of 'str' and 'int'".
scales:
  s: [0.33, 0.50, 1024]

# Backbone (unchanged from yolov8s-seg.pt)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0 — P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 — P2/4
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 — P3/8
  - [-1, 6, C2f, [256, True]]          # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5 — P4/16
  - [-1, 6, C2f, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7 — P5/32
  - [-1, 3, C2f, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9

# Head — P2–P5 FPN + segment heads
# The P2 branch uses layer 2 (stride-4 feature map) directly.
head:
  # Top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10 — upsample P5
  - [[-1, 6], 1, Concat, [1]]                    # 11 — cat P5 + P4
  - [-1, 3, C2f, [512]]                           # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13 — upsample P4
  - [[-1, 4], 1, Concat, [1]]                    # 14 — cat + P3
  - [-1, 3, C2f, [256]]                           # 15 — P3/8 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16 — upsample P3
  - [[-1, 2], 1, Concat, [1]]                    # 17 — cat + P2 (stride 4)
  - [-1, 3, C2f, [128]]                           # 18 — P2/4 features

  # Bottom-up PAN
  - [-1, 1, Conv, [128, 3, 2]]                    # 19 — downsample P2
  - [[-1, 15], 1, Concat, [1]]                   # 20 — cat P3 features
  - [-1, 3, C2f, [256]]                           # 21

  - [-1, 1, Conv, [256, 3, 2]]                    # 22 — downsample P3
  - [[-1, 12], 1, Concat, [1]]                   # 23 — cat P4 features
  - [-1, 3, C2f, [512]]                           # 24

  - [-1, 1, Conv, [512, 3, 2]]                    # 25 — downsample P4
  - [[-1, 9], 1, Concat, [1]]                    # 26 — cat P5 features
  - [-1, 3, C2f, [1024]]                          # 27

  # Segment heads at P3, P4, P5, P2 (4 detection layers).
  # IMPORTANT: the Segment mask Proto is built from the FIRST input (ch[0]); for
  # segmentation it must sit on a stride-8 (P3) feature like stock yolov8-seg.
  # Listing P2 (stride 4) first makes the proto run at 2x resolution and a
  # downstream mask matmul fails with a 4x shape mismatch ("mat1 and mat2 shapes
  # cannot be multiplied (Nx27200 and 108800x300)"). So order is [P3, P4, P5, P2]:
  # proto stays on P3 (layer 21) and P2 is still added as a 4th detection head.
  - [[21, 24, 27, 18], 1, Segment, [nc, 32, 256]]  # 28 — 4-head output (proto on P3)
